app/controllers/doctorprofiles_controller.rb

  def signedinuserdoctorprofile
doctorprofile = Doctorprofile.find_by_user_id(current_user.id)
---
SELECT  "doctorprofiles".* FROM "doctorprofiles" WHERE "doctorprofiles"."user_id" = ? LIMIT 1  [["user_id", 4]]

  def index
    @doctorprofiles = Doctorprofile.all
---
SELECT "doctorprofiles".* FROM "doctorprofiles"

  def create
    @doctorprofile = Doctorprofile.new(doctorprofile_params)

    respond_to do |format|
      if @doctorprofile.save
---
INSERT INTO "doctorprofiles" ("firstname", "lastname", "qualification", "clinic", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["firstname", "nil"], ["lastname", "nil"], ["qualification", "nil"], ["clinic", "nil"], ["user_id", 4], ["created_at", "2017-08-03 17:13:44.262619"], ["updated_at", "2017-08-03 17:13:44.262619"]]

    def set_doctorprofile
      @doctorprofile = Doctorprofile.find(params[:id])
---
SELECT  "doctorprofiles".* FROM "doctorprofiles" WHERE "doctorprofiles"."id" = ? LIMIT 1  [["id", 1]]