app/controllers/dtrecords_controller.rb

  def index
    @dtrecords = Dtrecord.all
---
SELECT "dtrecords".* FROM "dtrecords"

    def set_dtrecord
      @dtrecord = Dtrecord.find(params[:id])
---
SELECT  "dtrecords".* FROM "dtrecords" WHERE "dtrecords"."id" = ? LIMIT 1  [["id", 0]]