app/controllers/insts_controller.rb

SELECT "insts".* FROM "insts"
---
  def index
    @insts = Inst.all

INSERT INTO "insts" ("firstname", "lastname", "manufacturer", "description", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["firstname", ""], ["lastname", ""], ["manufacturer", ""], ["description", ""], ["color", ""], ["created_at", "2017-08-06 10:42:32.797954"], ["updated_at", "2017-08-06 10:42:32.797954"]]
---
  def create
    @inst = Inst.new(inst_params)

    respond_to do |format|
      if @inst.save

SELECT  "insts".* FROM "insts" WHERE "insts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_inst
      @inst = Inst.find(params[:id])