app/controllers/pt_records_controller.rb

  def index
    @pt_records = PtRecord.all
---
SELECT "pt_records".* FROM "pt_records" WHERE (firstname LIKE '%nil%')  ORDER BY created_at DESC

  def create
    @pt_record = PtRecord.new(pt_record_params)

    respond_to do |format|
      if @pt_record.save
---
INSERT INTO "pt_records" ("firstname", "lastname", "string", "email", "infection", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pt_record.update(pt_record_params)
---
UPDATE "pt_records" SET "firstname" = ?, "lastname" = ?, "email" = ?, "infection" = ?, "updated_at" = ? WHERE "pt_records"."id" = ?  [["firstname", "Sam"], ["lastname", "Dunkin"], ["email", "samdoo@gmail.com"], ["infection", "Bacterial"], ["updated_at", "2017-08-07 11:08:18.525300"], ["id", 3]]

    def set_pt_record
      @pt_record = PtRecord.find(params[:id])
---
SELECT  "pt_records".* FROM "pt_records" WHERE "pt_records"."id" = ? LIMIT 1  [["id", 1]]